[
  {
    "slug": "pushup-wall",
    "category": "strength",
    "name": "Wall Push-up",
    "name_ru": "Отжимания от стены",
    "tags": [
      "chest",
      "triceps",
      "shoulders",
      "beginner",
      "home",
      "wall"
    ],
    "difficulty": 1,
    "base_xp": 5,
    "required_level": 1,
    "equipment": "wall",
    "harder": "pushup-knee",
    "description": "Stand facing a wall at arm's length. Place your palms flat against the wall at shoulder height and shoulder-width apart. Keeping your body straight, bend your elbows to bring your chest toward the wall. Push back to the starting position. This is the easiest push-up variation, perfect for absolute beginners.",
    "description_ru": "Встань лицом к стене на расстоянии вытянутых рук. Упрись ладонями в стену на уровне плеч, руки на ширине плеч. Держи тело прямым от головы до пяток. Сгибай локти, приближая грудь к стене. Локти направлены слегка назад, не в стороны. Оттолкнись от стены и вернись в исходное положение. Это самый лёгкий вариант отжиманий, идеально подходит для начинающих, помогает освоить правильную технику и укрепить мышцы перед переходом к более сложным вариантам."
  },
  {
    "slug": "pushup-knee",
    "category": "strength",
    "name": "Knee Push-up",
    "name_ru": "Отжимания с колен",
    "tags": [
      "chest",
      "triceps",
      "shoulders",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 8,
    "required_level": 1,
    "equipment": "none",
    "easier": "pushup-wall",
    "harder": "pushup-regular",
    "description": "Start on all fours, then walk your hands forward until your body forms a straight line from head to knees. Keep your knees on the ground and cross your ankles behind you. Lower your chest toward the floor by bending your elbows, keeping them at a 45-degree angle to your body. Push back up to the starting position. This variation reduces the load compared to full push-ups while maintaining proper form.",
    "description_ru": "Встань на четвереньки, затем пройди руками вперёд, пока тело не образует прямую линию от головы до колен. Колени остаются на полу, голени можно скрестить. Руки расположи на ширине плеч или чуть шире. Опускайся вниз, сгибая локти под углом примерно 45 градусов к корпусу, пока грудь почти не коснётся пола. Не прогибай и не выгибай поясницу — тело прямое. Оттолкнись руками и вернись в исходное положение. Этот вариант снижает нагрузку по сравнению с полными отжиманиями, позволяя отработать технику и набрать силу."
  },
  {
    "slug": "pushup-regular",
    "category": "strength",
    "name": "Push-up",
    "name_ru": "Классические отжимания",
    "tags": [
      "chest",
      "triceps",
      "shoulders",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 1,
    "equipment": "none",
    "easier": "pushup-knee",
    "harder": "pushup-wide",
    "description": "Start in a high plank position with hands shoulder-width apart, arms straight, and body forming a straight line from head to heels. Lower your body by bending your elbows until your chest nearly touches the floor. Keep elbows at about 45 degrees from your torso, not flared out. Push through your palms to return to start. Engage your core throughout and don't let your hips sag or pike up.",
    "description_ru": "Прими упор лёжа: руки прямые, ладони на полу на ширине плеч, пальцы направлены вперёд. Тело образует прямую линию от макушки до пяток — не прогибай поясницу и не поднимай таз. Напряги пресс и ягодицы для стабильности. Опускайся вниз, сгибая локти под углом примерно 45 градусов к корпусу (не разводи их в стороны). Опустись до тех пор, пока грудь почти не коснётся пола. Мощно оттолкнись ладонями от пола и вернись в исходное положение, полностью выпрямляя руки. Дыши: вдох на опускании, выдох на подъёме."
  },
  {
    "slug": "pushup-wide",
    "category": "strength",
    "name": "Wide Push-up",
    "name_ru": "Широкие отжимания",
    "tags": [
      "chest",
      "triceps",
      "shoulders",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 1,
    "equipment": "none",
    "easier": "pushup-regular",
    "harder": "pushup-diamond",
    "description": "Assume a push-up position but place your hands wider than shoulder-width apart, roughly 1.5 times shoulder width. Your fingers can point slightly outward. Lower your body until your chest nearly touches the floor, then push back up. The wider hand placement shifts more emphasis to the chest muscles, especially the outer portion.",
    "description_ru": "Прими упор лёжа, но поставь руки значительно шире плеч — примерно в 1,5 раза шире обычной постановки. Пальцы можно слегка развернуть наружу для комфорта. Тело прямое от головы до пяток. Опускайся вниз, сгибая локти, пока грудь почти не коснётся пола. Локти будут уходить в стороны больше, чем при обычных отжиманиях. Оттолкнись и вернись в исходное положение. Широкая постановка рук смещает акцент на грудные мышцы, особенно на внешнюю часть груди, и немного снижает нагрузку на трицепс."
  },
  {
    "slug": "pushup-diamond",
    "category": "strength",
    "name": "Diamond Push-up",
    "name_ru": "Алмазные отжимания",
    "tags": [
      "chest",
      "triceps",
      "intermediate",
      "home"
    ],
    "difficulty": 3,
    "base_xp": 12,
    "required_level": 3,
    "equipment": "none",
    "easier": "pushup-wide",
    "harder": "pushup-clap",
    "description": "Start in a push-up position, but bring your hands close together directly under your chest. Touch your thumbs and index fingers together to form a diamond or triangle shape. Keep your elbows close to your body as you lower your chest toward your hands. Push back up to start. This variation heavily targets the triceps and inner chest.",
    "description_ru": "Прими упор лёжа, но сведи руки вместе прямо под грудью. Соедини большие и указательные пальцы так, чтобы они образовали форму ромба (алмаза) или треугольника. Тело прямое, пресс напряжён. Опускайся вниз, держа локти близко к корпусу — они будут скользить вдоль боков. Опустись, пока грудь не коснётся рук. Оттолкнись и вернись в исходное положение. Эта вариация сильно нагружает трицепсы и внутреннюю часть грудных мышц. Если запястьям некомфортно, можно слегка развести руки."
  },
  {
    "slug": "pushup-clap",
    "category": "strength",
    "name": "Clap Push-up",
    "name_ru": "Отжимания с хлопком",
    "tags": [
      "chest",
      "triceps",
      "shoulders",
      "advanced",
      "home"
    ],
    "difficulty": 4,
    "base_xp": 15,
    "required_level": 5,
    "equipment": "none",
    "easier": "pushup-diamond",
    "harder": "pushup-archer",
    "description": "Start in a standard push-up position. Lower your chest to the floor, then explosively push up with enough force that your hands leave the ground. Quickly clap your hands together in the air, then land softly with slightly bent elbows to absorb the impact. Immediately go into the next rep. This plyometric exercise builds explosive power in the chest, shoulders, and triceps.",
    "description_ru": "Прими стандартный упор лёжа. Опустись вниз, как при обычном отжимании. Из нижней точки мощно и взрывно оттолкнись от пола так, чтобы руки оторвались от поверхности. В воздухе быстро хлопни в ладоши перед грудью. Приземлись на слегка согнутые руки, чтобы амортизировать удар, и сразу переходи к следующему повторению. Важно: приземляйся мягко, не на прямые руки, чтобы избежать травмы. Это плиометрическое упражнение развивает взрывную силу груди, плеч и трицепсов."
  },
  {
    "slug": "pushup-archer",
    "category": "strength",
    "name": "Archer Push-up",
    "name_ru": "Отжимания лучника",
    "tags": [
      "chest",
      "triceps",
      "shoulders",
      "advanced",
      "home"
    ],
    "difficulty": 4,
    "base_xp": 15,
    "required_level": 5,
    "equipment": "none",
    "easier": "pushup-clap",
    "harder": "pushup-one-arm",
    "description": "Start in a wide push-up position with hands placed much wider than shoulders, fingers pointing outward. As you lower yourself, shift your body toward one hand, bending that elbow while keeping the other arm almost straight. Your body moves diagonally. Push back up and repeat on the other side, alternating with each rep. This unilateral exercise prepares you for one-arm push-ups.",
    "description_ru": "Прими упор лёжа с очень широкой постановкой рук — значительно шире плеч. Пальцы направлены в стороны. При опускании смещай корпус к одной руке, сгибая её в локте, в то время как вторая рука остаётся почти прямой и скользит в сторону. Твоё тело движется по диагонали к рабочей руке. Грудь опускается к ладони согнутой руки. Оттолкнись и вернись в центр, затем повтори на другую сторону. Чередуй стороны с каждым повторением. Это упражнение развивает одностороннюю силу и готовит к отжиманиям на одной руке."
  },
  {
    "slug": "pushup-one-arm",
    "category": "strength",
    "name": "One-Arm Push-up",
    "name_ru": "Отжимания на одной руке",
    "tags": [
      "chest",
      "triceps",
      "shoulders",
      "elite",
      "home"
    ],
    "difficulty": 5,
    "base_xp": 25,
    "required_level": 10,
    "equipment": "none",
    "easier": "pushup-archer",
    "description": "Place one hand on the floor under your chest and the other behind your back. Spread your feet wide (wider than shoulder-width) for balance. Keep your body as straight as possible, though some hip rotation is normal. Lower yourself by bending your elbow until your chest nearly touches the floor. Push back up. This is an elite-level exercise requiring significant strength and body control.",
    "description_ru": "Поставь одну руку на пол под грудью или чуть сбоку, вторую руку убери за спину. Расставь ноги широко — значительно шире плеч — для баланса. Тело старайся держать максимально прямым, хотя небольшое вращение бёдер допустимо. Напряги кор очень сильно. Опускайся вниз, сгибая рабочую руку, пока грудь почти не коснётся пола. Локоть направлен назад-в сторону. Мощно оттолкнись и вернись в исходное положение. Это элитное упражнение, требующее огромной силы груди, плеча, трицепса и отличного контроля тела. Начни с негативных повторений или частичной амплитуды."
  },
  {
    "slug": "pushup-pike",
    "category": "strength",
    "name": "Pike Push-up",
    "name_ru": "Отжимания пикой",
    "tags": [
      "shoulders",
      "triceps",
      "intermediate",
      "home"
    ],
    "difficulty": 3,
    "base_xp": 12,
    "required_level": 3,
    "equipment": "none",
    "harder": "pushup-handstand",
    "description": "Start in a downward dog position: hands and feet on the floor, hips raised high so your body forms an inverted V shape. Your hands should be shoulder-width apart. Bend your elbows and lower the top of your head toward the floor between your hands. Push back up to start. This variation primarily targets the shoulders and serves as preparation for handstand push-ups.",
    "description_ru": "Начни в позиции «горка» или «собака мордой вниз»: руки и ноги на полу, таз поднят высоко вверх, тело образует перевёрнутую букву V. Руки на ширине плеч, ноги можно поставить вместе или слегка расставить. Сгибай локти и опускай голову вниз к полу, между ладонями. Локти направлены назад или слегка в стороны. Опустись, пока голова почти не коснётся пола. Оттолкнись руками и вернись в исходное положение. Чем ближе ноги к рукам и выше таз, тем больше нагрузка на плечи. Это упражнение отлично прорабатывает передние и средние дельты и готовит к отжиманиям в стойке на руках."
  },
  {
    "slug": "pushup-handstand",
    "category": "strength",
    "name": "Handstand Push-up",
    "name_ru": "Отжимания в стойке на руках",
    "tags": [
      "shoulders",
      "triceps",
      "elite",
      "home",
      "wall"
    ],
    "difficulty": 5,
    "base_xp": 20,
    "required_level": 8,
    "equipment": "wall",
    "easier": "pushup-pike",
    "description": "Kick up into a handstand against a wall, facing away from it. Hands shoulder-width apart, arms straight. Slowly lower yourself by bending your elbows until the top of your head lightly touches the floor. Press back up to straight arms. Keep your core tight and body as straight as possible. This is an advanced exercise that requires significant shoulder and tricep strength.",
    "description_ru": "Встань в стойку на руках у стены, лицом от стены (спиной к стене). Руки на ширине плеч, полностью выпрямлены. Всё тело вытянуто вверх, пресс и ягодицы напряжены. Медленно сгибай локти, опуская голову к полу. Локти направляй вперёд или слегка в стороны, но не разводи их полностью. Опустись, пока макушка мягко не коснётся пола. Мощно выжми себя вверх до полного выпрямления рук. Это продвинутое упражнение, требующее очень сильных плеч и трицепсов. Начинай с частичной амплитуды, подкладывая под голову подушку или коврик."
  },
  {
    "slug": "pushup-incline",
    "category": "strength",
    "name": "Incline Push-up",
    "name_ru": "Отжимания в наклоне (ноги выше)",
    "tags": [
      "chest",
      "shoulders",
      "triceps",
      "intermediate",
      "home",
      "bench"
    ],
    "difficulty": 3,
    "base_xp": 12,
    "required_level": 2,
    "equipment": "bench",
    "description": "Place your feet on an elevated surface (bench, chair, or step) and your hands on the floor. The higher your feet, the harder the exercise. Perform a push-up by lowering your chest toward the floor and pushing back up. This variation increases the load on the upper chest and shoulders compared to regular push-ups.",
    "description_ru": "Поставь ноги на возвышение (скамья, стул, ступенька, диван), руки на полу на ширине плеч. Чем выше ноги, тем сложнее упражнение. Тело образует прямую линию от пяток до головы. Опускайся вниз, сгибая локти, пока грудь почти не коснётся пола. Локти под углом примерно 45 градусов к корпусу. Оттолкнись и вернись в исходное положение. Этот вариант увеличивает нагрузку на верхнюю часть груди и передние дельты по сравнению с обычными отжиманиями."
  },
  {
    "slug": "pushup-decline",
    "category": "strength",
    "name": "Decline Push-up",
    "name_ru": "Отжимания с руками на возвышении",
    "tags": [
      "chest",
      "triceps",
      "beginner",
      "home",
      "bench"
    ],
    "difficulty": 1,
    "base_xp": 8,
    "required_level": 1,
    "equipment": "bench",
    "description": "Place your hands on an elevated surface (bench, step, or sturdy chair) and your feet on the floor. Perform a push-up by lowering your chest toward the surface and pushing back up. This variation is easier than regular push-ups and emphasizes the lower chest. Great for beginners transitioning from wall push-ups.",
    "description_ru": "Поставь руки на возвышение (скамья, ступенька, крепкий стул), ноги на полу. Тело образует прямую линию. Опускайся вниз, сгибая локти, пока грудь почти не коснётся опоры. Оттолкнись и вернись в исходное положение. Этот вариант легче обычных отжиманий, так как уменьшает нагрузку за счёт угла. Акцент смещается на нижнюю часть груди. Отличный вариант для начинающих, переходящих от отжиманий от стены к отжиманиям от пола."
  },
  {
    "slug": "pushup-staggered",
    "category": "strength",
    "name": "Staggered Push-up",
    "name_ru": "Отжимания с разновысокими руками",
    "tags": [
      "chest",
      "triceps",
      "shoulders",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 2,
    "equipment": "none",
    "description": "Start in a push-up position, but place one hand slightly forward and one hand slightly back (staggered position). Perform a push-up, then switch hand positions for the next rep. This creates an uneven load that challenges stability and works each side of the chest differently.",
    "description_ru": "Прими упор лёжа, но поставь одну руку немного впереди плеча, а другую — немного позади (асимметричная позиция). Расстояние между руками по горизонтали примерно 15-20 см. Выполни отжимание, затем поменяй руки местами для следующего повторения. Можно делать несколько повторений на одну сторону, затем менять. Асимметричная нагрузка развивает стабильность кора и прорабатывает каждую сторону груди по-разному. Рука, которая впереди, получает больше нагрузки."
  },
  {
    "slug": "pushup-spiderman",
    "category": "strength",
    "name": "Spiderman Push-up",
    "name_ru": "Отжимания \"Человек-паук\"",
    "tags": [
      "chest",
      "triceps",
      "core",
      "hip-flexors",
      "advanced",
      "home"
    ],
    "difficulty": 4,
    "base_xp": 15,
    "required_level": 5,
    "equipment": "none",
    "description": "Start in a standard push-up position. As you lower yourself, bring one knee toward the elbow on the same side. Your leg moves out to the side, not under your body. Push back up while returning your leg to the starting position. Alternate legs with each rep. This variation adds core and hip flexor work to the standard push-up.",
    "description_ru": "Прими стандартный упор лёжа. При опускании одновременно подтяни одно колено к локтю той же стороны. Нога движется сбоку от корпуса, а не под ним, как будто ты ползёшь по стене как Человек-паук. Когда грудь приближается к полу, колено должно быть у локтя. При отжимании вверх верни ногу в исходное положение. Чередуй ноги с каждым повторением. Это упражнение добавляет работу косых мышц пресса и сгибателей бедра к обычным отжиманиям."
  },
  {
    "slug": "pushup-hindu",
    "category": "strength",
    "name": "Hindu Push-up",
    "name_ru": "Индийские отжимания",
    "tags": [
      "chest",
      "shoulders",
      "triceps",
      "back",
      "intermediate",
      "home"
    ],
    "difficulty": 3,
    "base_xp": 12,
    "required_level": 3,
    "equipment": "none",
    "description": "Start in a downward dog position (hips up, body in inverted V). Swoop down by bending your arms and bringing your chest forward and down, close to the floor. Continue the movement by arching your back and pushing your chest up toward the ceiling (like upward dog). Reverse the movement back to the starting position. This flowing movement works the entire upper body.",
    "description_ru": "Начни в позиции «горка» — таз высоко поднят, тело образует перевёрнутую V. Начни движение вниз: согни руки и «поднырни» грудью вперёд и вниз, проводя её близко к полу. Продолжай движение, прогибая спину назад и выталкивая грудь вверх к потолку — ты окажешься в позиции «кобры» или «собаки мордой вверх». Затем подними таз обратно вверх, возвращаясь в исходную «горку». Движение плавное и непрерывное, как волна. Это упражнение комплексно прорабатывает грудь, плечи, трицепс и спину, а также растягивает позвоночник."
  },
  {
    "slug": "pushup-pseudo-planche",
    "category": "strength",
    "name": "Pseudo Planche Push-up",
    "name_ru": "Псевдопланш отжимания",
    "tags": [
      "chest",
      "shoulders",
      "triceps",
      "core",
      "advanced",
      "home"
    ],
    "difficulty": 4,
    "base_xp": 18,
    "required_level": 6,
    "equipment": "none",
    "description": "Start in a push-up position but place your hands by your hips (fingers pointing toward feet or sideways) instead of by your shoulders. Lean your body forward so your shoulders are well ahead of your hands. Perform push-ups in this position. This advanced variation heavily loads the shoulders and prepares you for planche training.",
    "description_ru": "Прими упор лёжа, но поставь руки не на уровне плеч, а ближе к животу или бёдрам. Пальцы направлены в стороны или назад, к ногам. Наклони тело вперёд так, чтобы плечи оказались значительно впереди ладоней. В этом положении выполняй отжимания, сохраняя наклон вперёд. Чем сильнее наклон, тем тяжелее. Это продвинутое упражнение мощно нагружает передние дельты и готовит к элементам планша. Требует сильных плеч и запястий."
  },
  {
    "slug": "pushup-typewriter",
    "category": "strength",
    "name": "Typewriter Push-up",
    "name_ru": "Отжимания печатная машинка",
    "tags": [
      "chest",
      "triceps",
      "shoulders",
      "advanced",
      "home"
    ],
    "difficulty": 4,
    "base_xp": 15,
    "required_level": 5,
    "equipment": "none",
    "description": "Start in a wide push-up position. Lower yourself down, then shift your body horizontally from one hand to the other while staying low, as if typing on a typewriter. Move left, then right, then push back up. This maintains constant tension and works each side intensely.",
    "description_ru": "Прими упор лёжа с широкой постановкой рук. Опустись в нижнюю точку отжимания. Оставаясь внизу, смести корпус горизонтально к одной руке — она согнётся сильнее, а вторая выпрямится. Затем, не поднимаясь, переместись к другой руке, как каретка печатной машинки. После перемещения в обе стороны вытолкни себя вверх. Это упражнение поддерживает постоянное напряжение мышц и интенсивно прорабатывает каждую сторону груди поочерёдно."
  },
  {
    "slug": "pushup-explosive",
    "category": "strength",
    "name": "Explosive Push-up",
    "name_ru": "Взрывные отжимания",
    "tags": [
      "chest",
      "triceps",
      "shoulders",
      "advanced",
      "home"
    ],
    "difficulty": 4,
    "base_xp": 15,
    "required_level": 5,
    "equipment": "none",
    "description": "Perform a push-up with an explosive push at the top so that your hands leave the ground. You don't need to clap; focus on maximum height. Land softly with bent elbows and immediately go into the next rep. This plyometric exercise develops power in the pushing muscles.",
    "description_ru": "Выполни отжимание, но в верхней точке оттолкнись максимально мощно, чтобы руки оторвались от пола. Хлопок не обязателен — сосредоточься на максимальной высоте отрыва. Приземляйся мягко на слегка согнутые руки, чтобы амортизировать удар, и сразу переходи в следующее повторение. Это плиометрическое упражнение развивает взрывную силу толкающих мышц — груди, плеч и трицепсов."
  },
  {
    "slug": "dip-bench",
    "category": "strength",
    "name": "Bench Dips",
    "name_ru": "Обратные отжимания от скамьи",
    "tags": [
      "triceps",
      "chest",
      "intermediate",
      "home",
      "bench"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 1,
    "equipment": "bench",
    "harder": "dip-parallel",
    "description": "Sit on the edge of a bench or sturdy chair. Place your hands next to your hips, gripping the edge. Slide your hips off the bench with legs extended or bent (bent is easier). Lower your body by bending your elbows to about 90 degrees, keeping your back close to the bench. Push back up to straighten your arms. Keep elbows pointing backward, not out to the sides.",
    "description_ru": "Сядь на край скамьи, стула или дивана. Положи руки по бокам от бёдер, пальцы обхватывают край опоры. Сдвинь таз вперёд, чтобы он оказался перед скамьёй. Ноги можно согнуть (легче) или выпрямить (сложнее). Опускайся вниз, сгибая локти примерно до 90 градусов. Локти направлены строго назад, не в стороны. Спина скользит близко к скамье. Оттолкнись руками и вернись в исходное положение, полностью выпрямляя руки. Это упражнение изолированно прорабатывает трицепс."
  },
  {
    "slug": "dip-parallel",
    "category": "strength",
    "name": "Parallel Bar Dips",
    "name_ru": "Отжимания на брусьях",
    "tags": [
      "chest",
      "triceps",
      "shoulders",
      "intermediate",
      "outdoor",
      "dip-bars"
    ],
    "difficulty": 3,
    "base_xp": 15,
    "required_level": 3,
    "equipment": "dip-bars",
    "easier": "dip-bench",
    "harder": "dip-korean",
    "description": "Grip parallel bars and jump or push yourself up to the starting position with straight arms. Lower your body by bending your elbows until they reach about 90 degrees. Lean slightly forward to target the chest more, or stay upright to emphasize triceps. Push back up to straight arms. Keep your core engaged and avoid swinging.",
    "description_ru": "Возьмись за параллельные брусья и выйди в исходное положение — руки прямые, тело вертикально, ноги можно согнуть в коленях или скрестить. Опускайся вниз, сгибая локти до угла примерно 90 градусов или чуть ниже. Наклон корпуса вперёд смещает нагрузку на грудь; вертикальное положение — на трицепс. Локти направлены назад или слегка в стороны. Из нижней точки мощно вытолкни себя вверх до полного выпрямления рук. Держи кор напряжённым, не раскачивайся."
  },
  {
    "slug": "dip-korean",
    "category": "strength",
    "name": "Korean Dips",
    "name_ru": "Корейские отжимания",
    "tags": [
      "triceps",
      "shoulders",
      "advanced",
      "outdoor",
      "dip-bars"
    ],
    "difficulty": 4,
    "base_xp": 18,
    "required_level": 6,
    "equipment": "dip-bars",
    "easier": "dip-parallel",
    "description": "Position yourself behind a bar (like a railing) with your back to it. Grip the bar behind you with both hands. Lower your body by bending your elbows, going as deep as your shoulder mobility allows. Push back up. This variation places extreme demand on shoulder flexibility and tricep strength.",
    "description_ru": "Встань спиной к перекладине или брусьям. Возьмись за опору руками позади себя, хват на ширине плеч или чуть уже. Ноги впереди для баланса. Опускайся вниз, сгибая локти и отводя их назад. Опустись настолько глубоко, насколько позволяет подвижность плеч — это может быть достаточно глубоко. Вытолкни себя обратно вверх. Это упражнение требует хорошей гибкости плечевого пояса и сильно нагружает трицепсы и передние дельты. Начинай с небольшой амплитуды."
  },
  {
    "slug": "dip-russian",
    "category": "strength",
    "name": "Russian Dips",
    "name_ru": "Русские отжимания на брусьях",
    "tags": [
      "triceps",
      "chest",
      "shoulders",
      "advanced",
      "outdoor",
      "dip-bars"
    ],
    "difficulty": 4,
    "base_xp": 18,
    "required_level": 6,
    "equipment": "dip-bars",
    "description": "Start at the top of a regular dip. Lower yourself, but continue down until your forearms rest on top of the bars. Your elbows will be bent fully and supporting your weight on the bars. Push explosively off your forearms back to the straight-arm position. This is an advanced exercise combining dip strength with explosive power.",
    "description_ru": "Начни в верхней позиции обычного отжимания на брусьях. Опускайся вниз, но продолжай движение, пока предплечья не лягут на брусья. Локти полностью согнуты, вес тела на предплечьях и частично на кистях. Из этого положения мощно оттолкнись, выпрямляя руки, и вернись в верхнюю позицию с прямыми руками. Это продвинутое упражнение, сочетающее силу в отжиманиях с взрывной мощностью. Требует сильных трицепсов и хорошей координации."
  },
  {
    "slug": "dip-straight-bar",
    "category": "strength",
    "name": "Straight Bar Dips",
    "name_ru": "Отжимания на прямой перекладине",
    "tags": [
      "triceps",
      "chest",
      "shoulders",
      "intermediate",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 3,
    "base_xp": 15,
    "required_level": 4,
    "equipment": "pullup-bar",
    "description": "Grip a single bar (like a pull-up bar) and push yourself up so your waist is at bar level, arms straight, bar across your thighs/hips. Lean forward slightly and lower your body by bending your elbows until your chest nearly touches the bar. Push back up to start. This variation is part of the muscle-up movement.",
    "description_ru": "Возьмись за одну перекладину (турник) и выйди в упор — руки прямые, перекладина на уровне бёдер или пояса. Слегка наклонись вперёд. Опускайся вниз, сгибая локти, пока грудь почти не коснётся перекладины. Локти уходят назад. Вытолкни себя обратно вверх до полного выпрямления рук. Это упражнение является частью выхода силой (muscle-up) и хорошо прорабатывает трицепс и грудь в уникальном угле."
  },
  {
    "slug": "pullup-negative",
    "category": "strength",
    "name": "Negative Pull-up",
    "name_ru": "Негативные подтягивания",
    "tags": [
      "back",
      "biceps",
      "forearms",
      "beginner",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 1,
    "base_xp": 10,
    "required_level": 1,
    "equipment": "pullup-bar",
    "harder": "row-inverted",
    "description": "Use a box or jump to get to the top position of a pull-up with your chin above the bar. Slowly lower yourself down over 5-6 seconds, fighting gravity the entire way. When your arms are fully extended, let go or step down and repeat. This eccentric training builds the strength needed for full pull-ups.",
    "description_ru": "Используй подставку или подпрыгни, чтобы оказаться в верхней точке подтягивания — подбородок выше перекладины, хват сверху на ширине плеч. Теперь медленно, за 5-6 секунд, опускайся вниз, сопротивляясь гравитации всё время. Контролируй движение на всём пути. Когда руки полностью выпрямятся, отпусти перекладину или встань на подставку и повтори. Эта эксцентрическая тренировка строит силу, необходимую для полных подтягиваний."
  },
  {
    "slug": "row-inverted",
    "category": "strength",
    "name": "Inverted Row",
    "name_ru": "Австралийские подтягивания",
    "tags": [
      "back",
      "biceps",
      "intermediate",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 1,
    "equipment": "pullup-bar",
    "easier": "pullup-negative",
    "harder": "pullup-regular",
    "description": "Set a bar at about waist height (or use a sturdy table). Lie underneath with your chest under the bar. Grip the bar with straight arms, body straight from head to heels, heels on the ground. Pull your chest up to the bar, squeezing your shoulder blades together. Lower back down with control. The higher the bar, the easier the exercise.",
    "description_ru": "Установи перекладину примерно на уровне пояса или используй крепкий стол. Ляг под неё так, чтобы грудь была под перекладиной. Возьмись за перекладину прямыми руками, хват сверху на ширине плеч. Тело прямое от головы до пяток, пятки упираются в пол. Подтяни грудь к перекладине, сводя лопатки вместе. Плавно опустись обратно до полного выпрямления рук. Чем выше перекладина, тем легче упражнение. Можно согнуть ноги для упрощения."
  },
  {
    "slug": "pullup-regular",
    "category": "strength",
    "name": "Pull-up",
    "name_ru": "Подтягивания прямым хватом",
    "tags": [
      "back",
      "biceps",
      "forearms",
      "intermediate",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 3,
    "base_xp": 15,
    "required_level": 3,
    "equipment": "pullup-bar",
    "easier": "row-inverted",
    "harder": "pullup-wide",
    "description": "Hang from a bar with hands slightly wider than shoulder-width, palms facing away (overhand grip). From a dead hang with straight arms, pull yourself up until your chin clears the bar. Lower yourself back down with control to a full hang. Avoid swinging or kipping. Engage your back muscles by imagining pulling your elbows down to your hips.",
    "description_ru": "Повисни на перекладине хватом сверху (ладони от себя), руки чуть шире плеч. Из положения полного виса с прямыми руками подтянись вверх, пока подбородок не окажется выше перекладины. Тяни локти вниз и назад, представляя, что тянешь их к бёдрам — это активирует широчайшие. Плавно опустись обратно до полного выпрямления рук. Избегай раскачивания и рывков. Тело должно оставаться относительно вертикальным."
  },
  {
    "slug": "chinup",
    "category": "strength",
    "name": "Chin-up",
    "name_ru": "Подтягивания обратным хватом",
    "tags": [
      "back",
      "biceps",
      "forearms",
      "intermediate",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 2,
    "base_xp": 12,
    "required_level": 2,
    "equipment": "pullup-bar",
    "description": "Hang from a bar with hands shoulder-width apart, palms facing you (underhand/supinated grip). Pull yourself up until your chin is above the bar, then lower back down with control. This grip involves the biceps more than overhand pull-ups, making it slightly easier for most people.",
    "description_ru": "Повисни на перекладине обратным хватом (ладони к себе), руки на ширине плеч или чуть уже. Из полного виса подтянись вверх, пока подбородок не окажется выше перекладины. Плавно опустись обратно до полного выпрямления рук. Обратный хват больше включает бицепсы в работу, поэтому многим этот вариант даётся легче, чем подтягивания прямым хватом. Отличное упражнение для спины и бицепсов."
  },
  {
    "slug": "pullup-wide",
    "category": "strength",
    "name": "Wide Pull-up",
    "name_ru": "Подтягивания широким хватом",
    "tags": [
      "back",
      "biceps",
      "advanced",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 4,
    "base_xp": 18,
    "required_level": 5,
    "equipment": "pullup-bar",
    "easier": "pullup-regular",
    "harder": "pullup-archer",
    "description": "Hang from a bar with hands placed significantly wider than shoulder-width, palms facing away. Pull yourself up, focusing on bringing your chest to the bar rather than just your chin over it. Lower with control. The wide grip emphasizes the outer lats and makes the movement more challenging.",
    "description_ru": "Повисни на перекладине хватом значительно шире плеч — примерно в 1,5-2 раза шире. Ладони от себя. Подтягивайся, стараясь подтянуть грудь к перекладине, а не просто поднять подбородок выше. Локти направлены в стороны и вниз. Плавно опустись обратно. Широкий хват максимально нагружает широчайшие мышцы спины, особенно их внешнюю часть, и делает упражнение более сложным."
  },
  {
    "slug": "pullup-close",
    "category": "strength",
    "name": "Close Grip Pull-up",
    "name_ru": "Подтягивания узким хватом",
    "tags": [
      "back",
      "biceps",
      "intermediate",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 3,
    "base_xp": 15,
    "required_level": 3,
    "equipment": "pullup-bar",
    "description": "Hang from a bar with hands close together, almost touching. Use an overhand or neutral grip. Pull yourself up until your chin clears the bar, then lower with control. The close grip emphasizes the lower lats and involves the biceps more.",
    "description_ru": "Повисни на перекладине, поставив руки близко друг к другу — почти касаясь. Хват может быть сверху или нейтральный (если есть специальные ручки). Подтянись, пока подбородок не окажется выше перекладины. Плавно опустись обратно. Узкий хват акцентирует нагрузку на нижнюю часть широчайших и больше вовлекает бицепсы в работу."
  },
  {
    "slug": "pullup-archer",
    "category": "strength",
    "name": "Archer Pull-up",
    "name_ru": "Подтягивания лучника",
    "tags": [
      "back",
      "biceps",
      "forearms",
      "advanced",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 4,
    "base_xp": 20,
    "required_level": 6,
    "equipment": "pullup-bar",
    "easier": "pullup-wide",
    "harder": "pullup-one-arm",
    "description": "Take a very wide overhand grip on the bar. Pull yourself up toward one hand while keeping the other arm almost straight, extending it along the bar. Your body moves diagonally. Lower down and repeat to the other side. This trains each side more independently and builds toward one-arm pull-ups.",
    "description_ru": "Возьмись за перекладину очень широким хватом сверху. Подтягивайся к одной руке, сгибая её, в то время как вторая рука остаётся почти прямой, скользя по перекладине в сторону. Тело движется по диагонали к рабочей руке. В верхней точке подбородок у одной руки, вторая рука выпрямлена. Опустись и повтори на другую сторону. Это упражнение тренирует каждую сторону более независимо и готовит к подтягиваниям на одной руке."
  },
  {
    "slug": "pullup-one-arm",
    "category": "strength",
    "name": "One-Arm Pull-up",
    "name_ru": "Подтягивания на одной руке",
    "tags": [
      "back",
      "biceps",
      "forearms",
      "elite",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 5,
    "base_xp": 30,
    "required_level": 12,
    "equipment": "pullup-bar",
    "easier": "pullup-archer",
    "description": "Hang from a bar with one hand. The free arm can be at your side or behind your back. Pull yourself up until your chin is above the bar using only one arm. Lower with control. This elite-level exercise requires exceptional back, bicep, and grip strength. Most people need years of training to achieve this.",
    "description_ru": "Повисни на перекладине на одной руке. Свободную руку держи вдоль тела или за спиной. Подтянись до положения подбородок выше перекладины, используя только одну руку. Плавно опустись обратно. Это элитное упражнение, требующее исключительной силы спины, бицепса и хвата. Большинству людей требуются годы тренировок для достижения этого уровня. Начинай с подтягиваний лучника и негативных повторений на одной руке."
  },
  {
    "slug": "pullup-l-sit",
    "category": "strength",
    "name": "L-Sit Pull-up",
    "name_ru": "Подтягивания уголком",
    "tags": [
      "back",
      "biceps",
      "core",
      "advanced",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 4,
    "base_xp": 18,
    "required_level": 5,
    "equipment": "pullup-bar",
    "description": "Hang from a bar and raise your legs straight out in front of you, forming an L shape with your body. Hold this position while performing pull-ups. Keep your legs parallel to the ground throughout. This variation adds significant core work to the standard pull-up.",
    "description_ru": "Повисни на перекладине и подними прямые ноги перед собой так, чтобы тело образовало букву L — торс вертикальный, ноги горизонтальные. Удерживая ноги в этом положении, выполняй подтягивания. Ноги должны оставаться параллельными полу всё время. Этот вариант добавляет серьёзную нагрузку на пресс и сгибатели бедра к стандартным подтягиваниям."
  },
  {
    "slug": "pullup-commando",
    "category": "strength",
    "name": "Commando Pull-up",
    "name_ru": "Коммандо подтягивания",
    "tags": [
      "back",
      "biceps",
      "core",
      "intermediate",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 3,
    "base_xp": 15,
    "required_level": 3,
    "equipment": "pullup-bar",
    "description": "Stand sideways to the bar and grip it with both hands in line, one in front of the other (alternating grip). Pull yourself up, bringing one shoulder toward the bar. Lower and pull up to the other side. Alternate which shoulder goes up with each rep. This grip challenges the core and works the back from a unique angle.",
    "description_ru": "Встань боком к перекладине. Возьмись за неё двумя руками вдоль — одна рука перед другой, хват разноимённый (одна ладонь к себе, другая от себя). Подтянись, поднимая одно плечо к перекладине, голова уходит в сторону от грифа. Опустись и подтянись к другому плечу. Чередуй стороны с каждым повторением. Этот хват создаёт уникальную нагрузку на кор и прорабатывает спину под необычным углом."
  },
  {
    "slug": "pullup-muscle-up",
    "category": "strength",
    "name": "Muscle-up",
    "name_ru": "Выход силой",
    "tags": [
      "back",
      "biceps",
      "chest",
      "triceps",
      "elite",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 5,
    "base_xp": 25,
    "required_level": 10,
    "equipment": "pullup-bar",
    "description": "Start hanging from a bar. Perform an explosive pull-up while simultaneously leaning forward. As your chest reaches bar height, quickly transition your grip and push yourself up over the bar until your arms are straight (ending in a dip position). Lower back down with control or drop to the hang and repeat.",
    "description_ru": "Повисни на перекладине хватом сверху, чуть шире плеч. Выполни взрывное подтягивание, одновременно подавая грудь вперёд и вверх. Когда грудь достигнет уровня перекладины, быстро перекинь локти над грифом — произойдёт переход из подтягивания в отжимание. Вытолкни себя вверх до выпрямления рук — ты окажешься в упоре над перекладиной. Плавно опустись обратно в вис или через негатив в отжимании и подтягивании. Это комплексное элитное упражнение, требующее силы и координации."
  },
  {
    "slug": "pullup-typewriter",
    "category": "strength",
    "name": "Typewriter Pull-up",
    "name_ru": "Подтягивания печатная машинка",
    "tags": [
      "back",
      "biceps",
      "forearms",
      "advanced",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 4,
    "base_xp": 18,
    "required_level": 6,
    "equipment": "pullup-bar",
    "description": "Take a wide grip and pull yourself up until your chin is above the bar. Staying up, shift your body horizontally from one hand to the other (like a typewriter carriage), keeping your chin above the bar throughout. After moving to both sides, lower yourself down. This maintains constant tension and builds tremendous strength.",
    "description_ru": "Возьмись широким хватом и подтянись до положения подбородок выше перекладины. Оставаясь наверху, перемести тело горизонтально от одной руки к другой, как каретка печатной машинки. Одна рука будет почти прямой, другая — сильно согнутой. Подбородок остаётся выше перекладины всё время. После перемещения в обе стороны опустись вниз. Это создаёт постоянное напряжение и строит огромную силу."
  },
  {
    "slug": "pullup-around-world",
    "category": "strength",
    "name": "Around the World Pull-up",
    "name_ru": "Подтягивания вокруг света",
    "tags": [
      "back",
      "biceps",
      "forearms",
      "advanced",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 4,
    "base_xp": 18,
    "required_level": 6,
    "equipment": "pullup-bar",
    "description": "Perform a wide-grip pull-up, but instead of going straight up and down, move in a circular motion. Pull up to one side, arc across the top to the other side, then lower. Reverse the circle on the next rep. This dynamic movement challenges strength through a full range of motion.",
    "description_ru": "Выполни подтягивание широким хватом, но вместо движения прямо вверх и вниз двигайся по кругу. Подтянись к одной руке, затем по дуге переместись через верх к другой руке, затем опустись вниз. На следующем повторении сделай круг в обратном направлении. Это динамическое движение бросает вызов силе через полный диапазон движения и развивает контроль."
  },
  {
    "slug": "pullup-clapping",
    "category": "strength",
    "name": "Clapping Pull-up",
    "name_ru": "Подтягивания с хлопком",
    "tags": [
      "back",
      "biceps",
      "forearms",
      "elite",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 5,
    "base_xp": 25,
    "required_level": 10,
    "equipment": "pullup-bar",
    "description": "Perform an explosive pull-up with enough force that your hands leave the bar at the top. Quickly clap your hands together, then catch the bar and lower yourself down. This plyometric exercise requires tremendous pulling power and excellent grip timing.",
    "description_ru": "Выполни взрывное подтягивание с такой силой, чтобы в верхней точке руки оторвались от перекладины. Быстро хлопни в ладоши и поймай перекладину обратно, затем опустись вниз. Это плиометрическое упражнение требует огромной тяговой мощности и отличного тайминга хвата. Очень травмоопасно — выполняй только при полном освоении обычных подтягиваний."
  },
  {
    "slug": "front-lever-raise",
    "category": "strength",
    "name": "Front Lever Raise",
    "name_ru": "Подъём в передний вис",
    "tags": [
      "back",
      "core",
      "shoulders",
      "elite",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 5,
    "base_xp": 25,
    "required_level": 12,
    "equipment": "pullup-bar",
    "description": "Hang from a bar with straight arms. Using your lats and core, raise your entire body (keeping it straight) until it's parallel to the ground in a front lever position. Hold briefly, then lower with control. This requires extreme lat and core strength.",
    "description_ru": "Повисни на перекладине с прямыми руками. Используя широчайшие мышцы спины и кор, подними всё тело (держа его прямым) до положения параллельно полу — это передний вис (front lever). Задержись на мгновение, затем плавно опустись обратно в вис. Это упражнение требует экстремальной силы широчайших и пресса. Начинай с подъёмов в группировке (колени согнуты)."
  },
  {
    "slug": "superman",
    "category": "strength",
    "name": "Superman",
    "name_ru": "Супермен",
    "tags": [
      "lower-back",
      "glutes",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 6,
    "required_level": 1,
    "equipment": "none",
    "description": "Lie face down on the floor with arms extended in front of you. Simultaneously lift your arms, chest, and legs off the ground, squeezing your glutes and lower back. Hold for 2-3 seconds at the top. Lower back down with control. Keep your neck neutral by looking at the floor.",
    "description_ru": "Ляг на живот, руки вытянуты вперёд, ноги прямые. Одновременно подними руки, грудь и ноги от пола, сжимая ягодицы и напрягая поясницу. Задержись в верхней точке на 2-3 секунды. Плавно опустись обратно. Держи шею в нейтральном положении, смотри в пол. Это базовое упражнение укрепляет мышцы-разгибатели спины и ягодицы."
  },
  {
    "slug": "swimmer",
    "category": "strength",
    "name": "Swimmer",
    "name_ru": "Пловец",
    "tags": [
      "lower-back",
      "glutes",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 6,
    "required_level": 1,
    "equipment": "none",
    "description": "Lie face down with arms extended in front of you. Lift your chest and legs slightly off the ground. Alternately raise your opposite arm and leg higher while lowering the others, as if swimming. Keep the movement controlled and continuous. This dynamic version of Superman adds coordination work.",
    "description_ru": "Ляг на живот, руки вытянуты вперёд. Слегка приподними грудь и ноги от пола. Попеременно поднимай выше противоположные руку и ногу (правая рука + левая нога, затем наоборот), имитируя движение пловца. Движение плавное и непрерывное. Это динамическая версия «супермена», добавляющая работу над координацией."
  },
  {
    "slug": "reverse-snow-angel",
    "category": "strength",
    "name": "Reverse Snow Angel",
    "name_ru": "Обратный снежный ангел",
    "tags": [
      "lower-back",
      "shoulders",
      "back",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 6,
    "required_level": 1,
    "equipment": "none",
    "description": "Lie face down with arms at your sides, palms facing down. Lift your chest, arms, and legs off the ground. Slowly sweep your arms in an arc from your sides to above your head (like making a snow angel), then return them to your sides. Keep everything lifted throughout.",
    "description_ru": "Ляг на живот, руки вдоль тела ладонями вниз. Подними грудь, руки и ноги от пола. Медленно веди руки дугой через стороны вверх над головой (как будто рисуешь снежного ангела), затем верни их обратно к бёдрам. Всё время держи грудь и ноги приподнятыми. Это упражнение прорабатывает поясницу, ромбовидные и задние дельты."
  },
  {
    "slug": "back-extension",
    "category": "strength",
    "name": "Back Extension",
    "name_ru": "Гиперэкстензия на полу",
    "tags": [
      "lower-back",
      "glutes",
      "hamstrings",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 6,
    "required_level": 1,
    "equipment": "none",
    "description": "Lie face down with hands behind your head or crossed on your chest. Keeping your hips and legs on the ground, lift your upper body as high as comfortably possible by contracting your lower back muscles. Hold briefly, then lower with control. Don't overextend or jerk up.",
    "description_ru": "Ляг на живот, руки за головой или скрещены на груди. Бёдра и ноги остаются прижатыми к полу. Поднимай верхнюю часть тела как можно выше за счёт сокращения мышц поясницы. Задержись на секунду в верхней точке, затем плавно опустись. Не переразгибай спину и не делай рывков. Это упражнение укрепляет разгибатели спины."
  },
  {
    "slug": "prone-y-raise",
    "category": "strength",
    "name": "Prone Y Raise",
    "name_ru": "Y-подъёмы лёжа",
    "tags": [
      "back",
      "shoulders",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 5,
    "required_level": 1,
    "equipment": "none",
    "description": "Lie face down with arms extended in front at a 45-degree angle, forming a Y shape. Lift your arms off the ground as high as possible, squeezing your shoulder blades together. Hold briefly, then lower. Keep your forehead on the ground or slightly lifted. Great for shoulder health and posture.",
    "description_ru": "Ляг на живот, руки вытянуты вперёд под углом примерно 45 градусов, образуя букву Y. Большие пальцы направлены вверх. Подними руки от пола как можно выше, сводя лопатки вместе. Задержись на секунду, затем опусти. Лоб можно держать на полу или слегка приподнять. Отлично для здоровья плеч и осанки."
  },
  {
    "slug": "prone-t-raise",
    "category": "strength",
    "name": "Prone T Raise",
    "name_ru": "T-подъёмы лёжа",
    "tags": [
      "back",
      "shoulders",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 5,
    "required_level": 1,
    "equipment": "none",
    "description": "Lie face down with arms extended out to the sides, forming a T shape. Thumbs pointing up. Lift your arms toward the ceiling, squeezing your shoulder blades together. Hold briefly, then lower with control. This targets the mid-back and rear deltoids.",
    "description_ru": "Ляг на живот, руки вытянуты в стороны, образуя букву T. Большие пальцы направлены вверх. Подними руки к потолку, сводя лопатки вместе. Задержись на секунду, затем плавно опусти. Это упражнение нацелено на среднюю часть спины и задние дельты. Важно для осанки и здоровья плечевого пояса."
  },
  {
    "slug": "prone-w-raise",
    "category": "strength",
    "name": "Prone W Raise",
    "name_ru": "W-подъёмы лёжа",
    "tags": [
      "back",
      "shoulders",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 5,
    "required_level": 1,
    "equipment": "none",
    "description": "Lie face down with arms bent at the elbows, forming a W shape (elbows at 90 degrees, upper arms at 45 degrees from body). Lift your arms off the ground by squeezing your shoulder blades down and together. Hold briefly, then lower. Excellent for rotator cuff and postural muscles.",
    "description_ru": "Ляг на живот, руки согнуты в локтях под углом 90 градусов, образуя букву W — плечи под углом примерно 45 градусов к телу, предплечья направлены вперёд. Подними руки от пола, сводя лопатки вниз и вместе. Задержись на секунду, затем опусти. Отличное упражнение для вращательной манжеты плеча и постуральных мышц."
  },
  {
    "slug": "squat-regular",
    "category": "strength",
    "name": "Squat",
    "name_ru": "Приседания",
    "tags": [
      "quads",
      "glutes",
      "hamstrings",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 8,
    "required_level": 1,
    "equipment": "none",
    "harder": "squat-jump",
    "description": "Stand with feet shoulder-width apart, toes pointing slightly outward. Push your hips back and bend your knees to lower your body as if sitting in a chair. Keep your chest up and back straight. Lower until your thighs are at least parallel to the floor (or as deep as mobility allows). Push through your heels to stand back up.",
    "description_ru": "Встань, ноги на ширине плеч, носки слегка развёрнуты наружу. Отводи таз назад и сгибай колени, опускаясь как будто садишься на стул. Держи грудь приподнятой, спину прямой. Колени движутся в направлении носков, не заваливаются внутрь. Опустись до параллели бёдер с полом или глубже, если позволяет гибкость. Оттолкнись пятками и встань обратно. Это базовое упражнение для всех мышц ног."
  },
  {
    "slug": "squat-sumo",
    "category": "strength",
    "name": "Sumo Squat",
    "name_ru": "Приседания сумо",
    "tags": [
      "quads",
      "glutes",
      "hip-flexors",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 8,
    "required_level": 1,
    "equipment": "none",
    "description": "Stand with feet wider than shoulder-width, toes pointed outward at about 45 degrees. Lower your body by bending your knees and pushing your hips back, keeping your torso upright. Go as deep as your mobility allows. Push through your heels to return to standing. This variation targets the inner thighs and glutes more.",
    "description_ru": "Встань, расставив ноги значительно шире плеч, носки развёрнуты наружу примерно на 45 градусов. Опускайся вниз, сгибая колени и отводя таз назад. Колени разводятся в стороны, следуя направлению носков. Держи корпус вертикально. Опустись как можно глубже. Оттолкнись пятками и вернись в исходное положение. Эта вариация больше нагружает внутреннюю часть бёдер и ягодицы."
  },
  {
    "slug": "squat-jump",
    "category": "strength",
    "name": "Jump Squat",
    "name_ru": "Приседания с выпрыгиванием",
    "tags": [
      "quads",
      "glutes",
      "calves",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 12,
    "required_level": 2,
    "equipment": "none",
    "easier": "squat-regular",
    "harder": "squat-pistol-assisted",
    "description": "Perform a regular squat, but as you rise, explode upward into a jump. Land softly on the balls of your feet, immediately lowering into the next squat. Keep your core tight throughout. This plyometric movement builds explosive leg power.",
    "description_ru": "Выполни обычное приседание, но при подъёме мощно выпрыгни вверх. Помогай руками — маши ими вверх при прыжке. Приземляйся мягко на носки, затем на всю стопу, сразу переходя в следующий присед. Держи кор напряжённым всё время. Это плиометрическое упражнение развивает взрывную силу ног."
  },
  {
    "slug": "squat-pistol-assisted",
    "category": "strength",
    "name": "Assisted Pistol Squat",
    "name_ru": "Пистолетик с опорой",
    "tags": [
      "quads",
      "glutes",
      "hamstrings",
      "advanced",
      "home"
    ],
    "difficulty": 3,
    "base_xp": 15,
    "required_level": 4,
    "equipment": "none",
    "easier": "squat-jump",
    "harder": "squat-pistol",
    "description": "Stand on one leg, holding onto a door frame, pole, or TRX straps for support. Extend the other leg in front of you. Lower yourself on one leg as deep as possible, using the support to help balance and assist the movement. Push through your heel to stand back up. This builds strength for full pistol squats.",
    "description_ru": "Встань на одну ногу, держась за дверной косяк, шест или TRX-петли для поддержки. Вторую ногу вытяни вперёд перед собой. Опускайся на одной ноге как можно глубже, используя опору для баланса и частичной помощи при подъёме. Оттолкнись пяткой и встань обратно. Это упражнение строит силу для полных приседаний пистолетом."
  },
  {
    "slug": "squat-pistol",
    "category": "strength",
    "name": "Pistol Squat",
    "name_ru": "Пистолетик",
    "tags": [
      "quads",
      "glutes",
      "hamstrings",
      "elite",
      "home"
    ],
    "difficulty": 5,
    "base_xp": 25,
    "required_level": 8,
    "equipment": "none",
    "easier": "squat-pistol-assisted",
    "description": "Stand on one leg with the other leg extended straight in front of you. Lower yourself as deep as possible on the standing leg, keeping the extended leg off the ground. Your arms can extend forward for balance. Push through your heel to stand back up without touching the ground with your free leg. This requires exceptional leg strength, balance, and flexibility.",
    "description_ru": "Встань на одну ногу, вторую вытяни прямо перед собой. Опускайся на опорной ноге как можно глубже — в идеале до полного приседа, когда ягодица почти касается пятки. Свободная нога остаётся прямой и не касается пола. Руки вытяни вперёд для баланса. Оттолкнись пяткой и встань обратно без помощи. Это элитное упражнение требует исключительной силы ног, баланса и гибкости голеностопа."
  },
  {
    "slug": "squat-cossack",
    "category": "strength",
    "name": "Cossack Squat",
    "name_ru": "Казачьи приседания",
    "tags": [
      "quads",
      "glutes",
      "hip-flexors",
      "hamstrings",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 2,
    "equipment": "none",
    "description": "Stand with feet very wide, toes pointing forward or slightly out. Shift your weight to one side and squat deeply on that leg while keeping the other leg straight with toes pointing up. Your hands can be out front for balance. Push back to center and repeat on the other side. Great for hip mobility and leg strength.",
    "description_ru": "Встань в очень широкую стойку, носки вперёд или слегка наружу. Перенеси вес на одну ногу и присядь на ней глубоко, в то время как вторая нога остаётся полностью прямой с носком, направленным вверх. Руки держи перед собой для баланса. Оттолкнись и вернись в центр, затем повтори на другую сторону. Отличное упражнение для мобильности тазобедренных суставов и силы ног."
  },
  {
    "slug": "squat-sissy",
    "category": "strength",
    "name": "Sissy Squat",
    "name_ru": "Сисси приседания",
    "tags": [
      "quads",
      "intermediate",
      "home"
    ],
    "difficulty": 3,
    "base_xp": 12,
    "required_level": 3,
    "equipment": "none",
    "description": "Stand near a support for balance. Rise onto your toes and lean your torso backward while bending your knees and pushing them forward. Lower until your thighs and torso form a straight line (like a reverse plank angle). Push back up to standing. This isolates the quadriceps intensely.",
    "description_ru": "Встань рядом с опорой для баланса. Поднимись на носки и начни отклонять корпус назад, одновременно сгибая колени и выводя их вперёд. Опускайся, пока бёдра и корпус не образуют примерно прямую линию под углом — тело наклонено назад от коленей. Оттолкнись и вернись в исходное положение. Это упражнение интенсивно изолирует квадрицепсы."
  },
  {
    "slug": "squat-shrimp",
    "category": "strength",
    "name": "Shrimp Squat",
    "name_ru": "Приседания креветка",
    "tags": [
      "quads",
      "glutes",
      "hamstrings",
      "advanced",
      "home"
    ],
    "difficulty": 4,
    "base_xp": 18,
    "required_level": 6,
    "equipment": "none",
    "description": "Stand on one leg and grab the ankle of your other leg behind you, pulling your heel toward your glute. Lower yourself by bending the standing leg until the knee of your back leg touches the ground. Stand back up while keeping hold of your back foot. This is an advanced single-leg exercise.",
    "description_ru": "Встань на одну ногу, вторую согни назад и возьми её за голеностоп, подтягивая пятку к ягодице. Опускайся, сгибая опорную ногу, пока колено задней ноги не коснётся пола. Встань обратно, удерживая заднюю ногу. Это продвинутое одноногое упражнение, альтернатива пистолетику с другим акцентом на мышцы."
  },
  {
    "slug": "squat-hindu",
    "category": "strength",
    "name": "Hindu Squat",
    "name_ru": "Индийские приседания",
    "tags": [
      "quads",
      "glutes",
      "calves",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 2,
    "equipment": "none",
    "description": "Start standing with feet shoulder-width apart. Squat down while rising onto your toes and swinging your arms back. At the bottom, your heels are off the ground. Swing your arms forward as you stand up, then repeat in a continuous flowing motion. This traditional Indian exercise builds leg endurance.",
    "description_ru": "Встань, ноги на ширине плеч. Приседай, одновременно поднимаясь на носки и отводя руки назад. В нижней точке пятки оторваны от пола, ты стоишь на носках в глубоком приседе. При подъёме маши руками вперёд и вверх. Движение непрерывное и плавное. Это традиционное индийское упражнение развивает выносливость ног."
  },
  {
    "slug": "squat-split",
    "category": "strength",
    "name": "Split Squat",
    "name_ru": "Сплит-приседания",
    "tags": [
      "quads",
      "glutes",
      "hamstrings",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 2,
    "equipment": "none",
    "description": "Stand in a staggered stance with one foot forward and one foot back (about 2-3 feet apart). Lower your body by bending both knees until your back knee nearly touches the floor. Keep your front knee over your ankle. Push through your front heel to stand. Complete all reps on one side before switching.",
    "description_ru": "Встань в разножку — одна нога впереди, другая сзади, расстояние между стопами примерно 60-90 см. Опускайся вниз, сгибая оба колена, пока заднее колено почти не коснётся пола. Переднее колено остаётся над голеностопом, не выходит далеко за носок. Оттолкнись передней пяткой и встань. Выполни все повторения на одну сторону, затем поменяй ноги."
  },
  {
    "slug": "lunge-forward",
    "category": "strength",
    "name": "Forward Lunges",
    "name_ru": "Выпады вперёд",
    "tags": [
      "quads",
      "glutes",
      "hamstrings",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 1,
    "equipment": "none",
    "harder": "lunge-jump",
    "description": "Stand tall with feet together. Step forward with one leg and lower your body until both knees are bent at about 90 degrees. Your back knee should nearly touch the floor. Push off your front foot to return to standing. Alternate legs with each rep or complete all reps on one side first.",
    "description_ru": "Встань прямо, ноги вместе. Сделай широкий шаг вперёд одной ногой и опустись вниз, пока оба колена не согнутся примерно до 90 градусов. Заднее колено почти касается пола. Переднее колено над голеностопом, не выходит за носок. Оттолкнись передней ногой и вернись в исходное положение. Чередуй ноги или сделай все повторения на одну сторону."
  },
  {
    "slug": "lunge-reverse",
    "category": "strength",
    "name": "Reverse Lunges",
    "name_ru": "Выпады назад",
    "tags": [
      "quads",
      "glutes",
      "hamstrings",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 1,
    "equipment": "none",
    "description": "Stand tall with feet together. Step backward with one leg and lower until both knees form 90-degree angles. Push through your front heel to return to standing. This variation is often easier on the knees than forward lunges and emphasizes the glutes more.",
    "description_ru": "Встань прямо, ноги вместе. Сделай широкий шаг назад одной ногой и опустись, пока оба колена не согнутся до 90 градусов. Заднее колено почти касается пола. Оттолкнись передней пяткой и вернись в исходное положение. Этот вариант часто легче для коленей, чем выпады вперёд, и больше акцентирует нагрузку на ягодицы."
  },
  {
    "slug": "lunge-side",
    "category": "strength",
    "name": "Side Lunges",
    "name_ru": "Выпады в сторону",
    "tags": [
      "quads",
      "glutes",
      "hip-flexors",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 1,
    "equipment": "none",
    "description": "Stand with feet together. Step out to one side and lower your body by bending that knee, keeping the other leg straight. Push your hips back as you lower. Push off the bent leg to return to center. This movement targets the inner thighs and improves lateral mobility.",
    "description_ru": "Встань, ноги вместе. Сделай широкий шаг в сторону одной ногой и опустись, сгибая это колено, в то время как вторая нога остаётся прямой. Отводи таз назад при опускании, носок согнутой ноги направлен вперёд. Опустись как можно ниже. Оттолкнись согнутой ногой и вернись в центр. Это упражнение прорабатывает внутреннюю часть бёдер и улучшает боковую подвижность."
  },
  {
    "slug": "lunge-jump",
    "category": "strength",
    "name": "Jump Lunges",
    "name_ru": "Прыжковые выпады",
    "tags": [
      "quads",
      "glutes",
      "calves",
      "advanced",
      "home"
    ],
    "difficulty": 3,
    "base_xp": 15,
    "required_level": 3,
    "equipment": "none",
    "easier": "lunge-forward",
    "description": "Start in a lunge position. Explosively jump up, switching your legs in mid-air, and land in a lunge with the opposite leg forward. Immediately jump again to switch. Keep your core tight and land softly. This plyometric exercise builds explosive leg power and coordination.",
    "description_ru": "Начни в позиции выпада — одна нога впереди, другая сзади, оба колена согнуты. Мощно выпрыгни вверх, поменяй ноги в воздухе и приземлись в выпад с другой ногой впереди. Сразу же прыгай снова для смены. Держи кор напряжённым, приземляйся мягко на носки. Это плиометрическое упражнение развивает взрывную силу ног и координацию."
  },
  {
    "slug": "lunge-bulgarian",
    "category": "strength",
    "name": "Bulgarian Split Squat",
    "name_ru": "Болгарские выпады",
    "tags": [
      "quads",
      "glutes",
      "hamstrings",
      "intermediate",
      "home",
      "bench"
    ],
    "difficulty": 3,
    "base_xp": 12,
    "required_level": 2,
    "equipment": "bench",
    "description": "Stand in front of a bench or chair, facing away. Place one foot behind you on the bench (top of foot or toes). Lower your body by bending your front knee until your thigh is parallel to the floor or your back knee nearly touches the ground. Push through your front heel to stand. Complete all reps on one leg before switching.",
    "description_ru": "Встань спиной к скамье или стулу на расстоянии широкого шага. Положи одну ногу на скамью позади себя (верхняя часть стопы или носок). Опускайся вниз, сгибая переднее колено, пока бедро не станет параллельным полу или заднее колено почти не коснётся земли. Переднее колено не выходит за носок. Оттолкнись передней пяткой и встань. Сделай все повторения на одну ногу, затем поменяй."
  },
  {
    "slug": "lunge-walking",
    "category": "strength",
    "name": "Walking Lunges",
    "name_ru": "Выпады в движении",
    "tags": [
      "quads",
      "glutes",
      "hamstrings",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 2,
    "equipment": "none",
    "description": "Step forward into a lunge, then push off your back foot and step that leg forward into the next lunge. Continue walking forward, alternating legs with each step. Keep your torso upright and core engaged throughout. Great for building functional leg strength.",
    "description_ru": "Сделай шаг вперёд в выпад, затем оттолкнись задней ногой и шагни ею вперёд в следующий выпад. Продолжай двигаться вперёд, чередуя ноги с каждым шагом. Держи корпус вертикально, кор напряжён. Отличное упражнение для развития функциональной силы ног."
  },
  {
    "slug": "lunge-curtsy",
    "category": "strength",
    "name": "Curtsy Lunges",
    "name_ru": "Реверанс выпады",
    "tags": [
      "quads",
      "glutes",
      "hip-flexors",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 2,
    "equipment": "none",
    "description": "Stand with feet hip-width apart. Step one leg diagonally behind you and across your body (like a curtsy). Lower until your front thigh is parallel to the floor. Push through your front heel to return to standing. This targets the glutes, especially the gluteus medius.",
    "description_ru": "Встань, ноги на ширине бёдер. Шагни одной ногой по диагонали назад и за другую ногу (как реверанс). Опустись, пока переднее бедро не станет параллельным полу. Заднее колено направлено к полу. Оттолкнись передней пяткой и вернись в исходное положение. Это упражнение прорабатывает ягодицы, особенно среднюю ягодичную мышцу."
  },
  {
    "slug": "step-up",
    "category": "strength",
    "name": "Step-ups",
    "name_ru": "Зашагивания на возвышение",
    "tags": [
      "quads",
      "glutes",
      "intermediate",
      "home",
      "bench"
    ],
    "difficulty": 2,
    "base_xp": 8,
    "required_level": 1,
    "equipment": "bench",
    "description": "Stand facing a bench, box, or sturdy platform. Step up onto it with one foot, pressing through that heel to lift your body up. Bring the second foot up to stand fully on the platform. Step down with the leading foot first. Alternate legs or complete all reps on one side. Keep your torso upright throughout.",
    "description_ru": "Встань лицом к скамье, тумбе или устойчивой платформе. Зашагни на неё одной ногой, отталкиваясь пяткой, чтобы поднять тело. Подтяни вторую ногу, полностью встав на платформу. Спустись, начиная с ведущей ноги. Чередуй ноги или выполни все повторы на одну сторону. Корпус прямой на протяжении всего движения."
  },
  {
    "slug": "step-up-lateral",
    "category": "strength",
    "name": "Lateral Step-ups",
    "name_ru": "Боковые зашагивания",
    "tags": [
      "quads",
      "glutes",
      "hip-flexors",
      "intermediate",
      "home",
      "bench"
    ],
    "difficulty": 2,
    "base_xp": 8,
    "required_level": 2,
    "equipment": "bench",
    "description": "Stand sideways to a bench or step. Step up sideways with the leg closest to the bench, pressing through your heel. Bring your other foot up, then step back down. This variation emphasizes the hip abductors and outer glutes more than forward step-ups.",
    "description_ru": "Встань боком к скамье или ступеньке. Зашагни боком ногой, ближней к скамье, давя через пятку. Подтяни вторую ногу наверх, затем спустись обратно. Эта вариация больше нагружает отводящие мышцы бедра и внешнюю часть ягодиц по сравнению с обычными зашагиваниями."
  },
  {
    "slug": "calf-raise",
    "category": "strength",
    "name": "Calf Raises",
    "name_ru": "Подъёмы на носки",
    "tags": [
      "calves",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 6,
    "required_level": 1,
    "equipment": "none",
    "harder": "calf-raise-single",
    "description": "Stand on the edge of a step with your heels hanging off. Lower your heels below the step level for a full stretch. Rise up onto your toes as high as possible, squeezing your calves at the top. Lower with control. Hold onto something for balance if needed. Can also be done on flat ground.",
    "description_ru": "Встань на край ступеньки так, чтобы пятки свисали. Опусти пятки ниже уровня ступеньки для полной растяжки икр. Поднимись на носки как можно выше, сжимая икры в верхней точке. Плавно опустись. Держись за что-нибудь для баланса при необходимости. Можно делать и на плоской поверхности, но со ступеньки амплитуда больше."
  },
  {
    "slug": "calf-raise-single",
    "category": "strength",
    "name": "Single Leg Calf Raises",
    "name_ru": "Подъём на носок одной ноги",
    "tags": [
      "calves",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 8,
    "required_level": 2,
    "equipment": "none",
    "easier": "calf-raise",
    "description": "Stand on one leg on a step with your heel hanging off. Hold onto something for balance. Lower your heel for a stretch, then rise onto your toes as high as possible. Complete all reps on one leg before switching. This doubles the load compared to two-leg calf raises.",
    "description_ru": "Встань на одну ногу на край ступеньки, пятка свисает. Держись за опору для баланса. Опусти пятку для растяжки, затем поднимись на носок как можно выше. Сделай все повторения на одну ногу, затем поменяй. Это удваивает нагрузку по сравнению с подъёмами на двух ногах."
  },
  {
    "slug": "glute-bridge",
    "category": "strength",
    "name": "Glute Bridge",
    "name_ru": "Ягодичный мостик",
    "tags": [
      "glutes",
      "hamstrings",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 6,
    "required_level": 1,
    "equipment": "none",
    "harder": "glute-bridge-single",
    "description": "Lie on your back with knees bent, feet flat on the floor hip-width apart. Push through your heels to lift your hips toward the ceiling, squeezing your glutes at the top. Your body should form a straight line from shoulders to knees. Hold briefly, then lower with control. Don't overarch your lower back.",
    "description_ru": "Ляг на спину, ноги согнуты в коленях, стопы на полу на ширине бёдер. Давя пятками в пол, подними таз к потолку, сжимая ягодицы в верхней точке. Тело должно образовать прямую линию от плеч до коленей. Задержись на секунду, затем плавно опустись. Не переразгибай поясницу — работают ягодицы, не спина."
  },
  {
    "slug": "glute-bridge-single",
    "category": "strength",
    "name": "Single Leg Glute Bridge",
    "name_ru": "Ягодичный мостик на одной ноге",
    "tags": [
      "glutes",
      "hamstrings",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 2,
    "equipment": "none",
    "easier": "glute-bridge",
    "description": "Set up as for a regular glute bridge, but extend one leg straight up toward the ceiling or out in front. Lift your hips using only the leg on the ground, squeezing your glute at the top. Lower with control. Complete all reps on one side before switching.",
    "description_ru": "Прими положение для обычного мостика, но одну ногу вытяни прямо вверх к потолку или вперёд. Подними таз, используя только опорную ногу, сжимая ягодицу в верхней точке. Плавно опустись. Сделай все повторения на одну сторону, затем поменяй ноги. Это удваивает нагрузку на ягодицу опорной ноги."
  },
  {
    "slug": "glute-kickback",
    "category": "strength",
    "name": "Glute Kickback",
    "name_ru": "Махи ногой назад",
    "tags": [
      "glutes",
      "hamstrings",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 6,
    "required_level": 1,
    "equipment": "none",
    "description": "Get on all fours with hands under shoulders and knees under hips. Keeping your knee bent at 90 degrees, lift one leg up and back until your thigh is in line with your body. Squeeze your glute at the top. Lower with control and repeat. Keep your back flat throughout.",
    "description_ru": "Встань на четвереньки — руки под плечами, колени под бёдрами. Держа колено согнутым под углом 90 градусов, подними одну ногу вверх и назад, пока бедро не окажется на одной линии с телом. Сожми ягодицу в верхней точке. Плавно опусти и повтори. Держи спину ровной, не прогибай поясницу."
  },
  {
    "slug": "donkey-kick",
    "category": "strength",
    "name": "Donkey Kicks",
    "name_ru": "Удары осла",
    "tags": [
      "glutes",
      "hamstrings",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 6,
    "required_level": 1,
    "equipment": "none",
    "description": "On all fours, keep your knee bent and lift your leg up as if pressing the sole of your foot toward the ceiling. Squeeze your glute at the top when your thigh is parallel to the ground. Lower and repeat. Keep your core engaged and back flat. Similar to glute kickback but often with a pushing motion.",
    "description_ru": "На четвереньках, держа колено согнутым, подними ногу вверх, как будто давишь стопой в потолок. Сожми ягодицу в верхней точке, когда бедро параллельно полу. Опусти и повтори. Держи кор напряжённым, спину ровной. Похоже на махи назад, но с акцентом на толкающее движение вверх."
  },
  {
    "slug": "fire-hydrant",
    "category": "strength",
    "name": "Fire Hydrant",
    "name_ru": "Пожарный гидрант",
    "tags": [
      "glutes",
      "hip-flexors",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 6,
    "required_level": 1,
    "equipment": "none",
    "description": "On all fours, keeping your knee bent at 90 degrees, lift one leg out to the side until your thigh is parallel to the floor (like a dog at a fire hydrant). Keep your hips level. Squeeze your outer glute at the top. Lower with control and repeat.",
    "description_ru": "На четвереньках, держа колено согнутым под углом 90 градусов, отведи одну ногу в сторону, пока бедро не станет параллельным полу (как собака у пожарного гидранта). Держи бёдра на одном уровне, не поворачивай корпус. Сожми внешнюю часть ягодицы в верхней точке. Плавно опусти и повтори. Отлично для средней ягодичной мышцы."
  },
  {
    "slug": "hip-thrust",
    "category": "strength",
    "name": "Hip Thrust",
    "name_ru": "Ягодичный мост с опорой",
    "tags": [
      "glutes",
      "hamstrings",
      "intermediate",
      "home",
      "bench"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 2,
    "equipment": "bench",
    "description": "Sit on the floor with your upper back against a bench. Bend your knees with feet flat on the floor. Push through your heels to lift your hips until your thighs and torso are in line. Squeeze your glutes hard at the top. Lower with control. This is one of the best exercises for glute development.",
    "description_ru": "Сядь на пол, прислонившись верхней частью спины (лопатками) к скамье. Ноги согнуты, стопы на полу на ширине бёдер. Давя пятками в пол, подними таз вверх, пока бёдра и корпус не образуют прямую линию. Мощно сожми ягодицы в верхней точке. Плавно опустись. Это одно из лучших упражнений для развития ягодиц."
  },
  {
    "slug": "nordic-curl",
    "category": "strength",
    "name": "Nordic Curl",
    "name_ru": "Скандинавские сгибания",
    "tags": [
      "hamstrings",
      "advanced",
      "home"
    ],
    "difficulty": 4,
    "base_xp": 18,
    "required_level": 6,
    "equipment": "none",
    "description": "Kneel on a soft surface with your ankles secured (under a couch, by a partner, or using a strap). Keeping your body straight from knees to head, slowly lower yourself forward by extending at the knees only. Control the descent as long as possible, then catch yourself with your hands. Push back up or use a small push from your hands to return. This is one of the most challenging hamstring exercises.",
    "description_ru": "Встань на колени на мягкой поверхности, голеностопы зафиксированы (под диваном, партнёром или ремнём). Держа тело прямым от коленей до головы, медленно опускайся вперёд, разгибаясь только в коленях. Контролируй спуск как можно дольше, затем поймай себя руками. Оттолкнись руками, чтобы вернуться, или используй только силу ног если можешь. Это одно из самых сложных упражнений для бицепса бедра."
  },
  {
    "slug": "good-morning",
    "category": "strength",
    "name": "Good Morning",
    "name_ru": "Гуд морнинг",
    "tags": [
      "hamstrings",
      "lower-back",
      "glutes",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 2,
    "equipment": "none",
    "description": "Stand with feet shoulder-width apart, hands behind your head or crossed on your chest. Keeping your back straight and knees slightly bent, hinge forward at the hips until your torso is roughly parallel to the floor. Squeeze your glutes and hamstrings to return to standing. Feel the stretch in your hamstrings at the bottom.",
    "description_ru": "Встань, ноги на ширине плеч, руки за головой или скрещены на груди. Держа спину прямой и колени слегка согнутыми, наклонись вперёд от бёдер (не округляя спину!), пока корпус не станет примерно параллелен полу. Почувствуй растяжение в задней поверхности бедра. Сожми ягодицы и бицепсы бедра, чтобы вернуться в исходное положение. Не округляй спину!"
  },
  {
    "slug": "crunch",
    "category": "strength",
    "name": "Crunches",
    "name_ru": "Скручивания",
    "tags": [
      "core",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 6,
    "required_level": 1,
    "equipment": "none",
    "description": "Lie on your back with knees bent and feet flat on the floor. Place your hands behind your head (don't pull on your neck!) or cross them on your chest. Engage your abs and lift your shoulder blades off the floor, curling your ribcage toward your pelvis. Hold briefly at the top, then lower back down with control. Keep your lower back pressed into the floor throughout — don't sit all the way up.",
    "description_ru": "Ляг на спину, согни колени, стопы на полу. Руки за головой (не тяни шею!) или скрещены на груди. Напряги пресс и оторви лопатки от пола, скручивая рёбра к тазу. Задержись на секунду в верхней точке, затем плавно опустись. Поясница прижата к полу на протяжении всего движения — не садись полностью. Это короткое контролируемое движение, акцент на верхнюю часть прямой мышцы живота."
  },
  {
    "slug": "crunch-reverse",
    "category": "strength",
    "name": "Reverse Crunches",
    "name_ru": "Обратные скручивания",
    "tags": [
      "core",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 6,
    "required_level": 1,
    "equipment": "none",
    "description": "Lie on your back with arms at your sides. Lift your legs so your thighs are perpendicular to the floor and knees bent at 90 degrees. Engage your lower abs to curl your hips off the floor, bringing your knees toward your chest. Lower your hips back down with control. Don't use momentum — focus on the lower abs doing the work. This targets the lower portion of the abdominals.",
    "description_ru": "Ляг на спину, руки вдоль тела ладонями вниз для опоры. Подними ноги так, чтобы бёдра были перпендикулярны полу, колени согнуты под 90 градусов. Напрягая нижнюю часть пресса, оторви таз от пола и подтяни колени к груди. Плавно опусти таз обратно. Не используй инерцию — работай мышцами пресса. Это упражнение нацелено на нижнюю часть прямой мышцы живота."
  },
  {
    "slug": "bicycle-crunch",
    "category": "strength",
    "name": "Bicycle Crunches",
    "name_ru": "Велосипед",
    "tags": [
      "core",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 1,
    "equipment": "none",
    "description": "Lie on your back with hands behind your head and legs raised, knees bent. Lift your shoulders off the floor. Bring your right elbow toward your left knee while straightening your right leg. Then switch, bringing your left elbow to your right knee while straightening your left leg. Continue alternating in a pedaling motion. Move with control, don't rush — quality over speed.",
    "description_ru": "Ляг на спину, руки за головой, ноги подняты, колени согнуты. Оторви лопатки от пола. Тянись правым локтем к левому колену, одновременно выпрямляя правую ногу. Затем смени стороны: левый локоть к правому колену, левая нога выпрямляется. Продолжай чередовать в движении педалирования. Двигайся плавно и контролируемо, не спеши — качество важнее скорости. Это отличное упражнение для всего пресса и косых мышц."
  },
  {
    "slug": "leg-raise",
    "category": "strength",
    "name": "Leg Raises",
    "name_ru": "Подъёмы ног лёжа",
    "tags": [
      "core",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 1,
    "equipment": "none",
    "harder": "leg-raise-hanging",
    "description": "Lie on your back with legs straight and arms at your sides (or hands under your lower back for support). Keeping legs straight and together, raise them until they point at the ceiling. Lower them back down slowly, stopping just before they touch the floor. Keep your lower back pressed into the ground — if it arches, bend your knees slightly or don't lower legs as far.",
    "description_ru": "Ляг на спину, ноги прямые, руки вдоль тела или ладони под поясницей для поддержки. Держа ноги прямыми и вместе, подними их до вертикального положения. Медленно опусти обратно, останавливаясь перед касанием пола. Поясница должна быть прижата к полу — если она отрывается, слегка согни колени или не опускай ноги так низко. Контролируй движение, не бросай ноги вниз."
  },
  {
    "slug": "leg-raise-hanging",
    "category": "strength",
    "name": "Hanging Leg Raises",
    "name_ru": "Подъёмы ног в висе",
    "tags": [
      "core",
      "forearms",
      "advanced",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 4,
    "base_xp": 15,
    "required_level": 5,
    "equipment": "pullup-bar",
    "easier": "leg-raise",
    "description": "Hang from a pull-up bar with arms fully extended and shoulders engaged (don't just hang passively). Keeping legs straight, raise them in front of you until they're parallel to the floor or higher. Lower with control. Don't swing — if you can't control the movement, start with knee raises. This is an advanced core exercise that also challenges grip strength.",
    "description_ru": "Повисни на турнике, руки полностью выпрямлены, плечи активны (не виси пассивно, слегка напряги плечи). Держа ноги прямыми, подними их перед собой до параллели с полом или выше. Опусти с контролем. Не раскачивайся — если не можешь контролировать движение, начни с подъёма коленей. Это продвинутое упражнение для кора, которое также тренирует силу хвата."
  },
  {
    "slug": "knee-raise-hanging",
    "category": "strength",
    "name": "Hanging Knee Raises",
    "name_ru": "Подъёмы коленей в висе",
    "tags": [
      "core",
      "forearms",
      "intermediate",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 3,
    "base_xp": 12,
    "required_level": 3,
    "equipment": "pullup-bar",
    "description": "Hang from a pull-up bar with arms extended. Bend your knees and raise them toward your chest, curling your pelvis up at the top for maximum ab engagement. Lower with control. Keep your body from swinging by engaging your core throughout. This is easier than straight leg raises and a good progression step.",
    "description_ru": "Повисни на турнике, руки выпрямлены. Согни колени и подтяни их к груди, в верхней точке слегка подкрути таз вверх для максимального сокращения пресса. Опусти с контролем. Не раскачивайся — держи кор напряжённым. Это более лёгкая версия подъёма прямых ног, хорошая ступень прогрессии."
  },
  {
    "slug": "mountain-climber",
    "category": "strength",
    "name": "Mountain Climbers",
    "name_ru": "Скалолаз",
    "tags": [
      "core",
      "shoulders",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 1,
    "equipment": "none",
    "description": "Start in a high plank position with hands under shoulders. Drive one knee toward your chest, then quickly switch legs, bringing the other knee forward as the first leg goes back. Continue alternating at a quick pace. Keep your hips level (don't let them bounce up and down) and core engaged. Can be done slowly for core focus or fast for cardio.",
    "description_ru": "Начни в упоре лёжа, руки под плечами. Подтяни одно колено к груди, затем быстро смени ноги — одна нога возвращается, другая идёт вперёд. Продолжай чередовать в быстром темпе. Держи бёдра на одном уровне (не подпрыгивай тазом) и кор напряжённым. Можно выполнять медленно для акцента на кор или быстро для кардио-эффекта."
  },
  {
    "slug": "russian-twist",
    "category": "strength",
    "name": "Russian Twist",
    "name_ru": "Русские скручивания",
    "tags": [
      "core",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 8,
    "required_level": 1,
    "equipment": "none",
    "description": "Sit on the floor with knees bent and feet either on the floor or raised (harder). Lean back slightly so your torso is at about 45 degrees. Hold your hands together in front of your chest. Rotate your torso to one side, then to the other, keeping your core engaged. For added difficulty, hold a weight or medicine ball.",
    "description_ru": "Сядь на пол, колени согнуты, стопы на полу или приподняты (сложнее). Отклонись назад так, чтобы корпус был под углом около 45 градусов к полу. Сложи руки перед грудью. Поворачивай корпус в одну сторону, затем в другую, держа кор напряжённым. Для усложнения держи гирю или мяч. Работают косые мышцы живота."
  },
  {
    "slug": "scissors",
    "category": "strength",
    "name": "Scissors",
    "name_ru": "Ножницы",
    "tags": [
      "core",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 8,
    "required_level": 1,
    "equipment": "none",
    "description": "Lie on your back with hands under your lower back or at your sides. Lift both legs a few inches off the floor. Alternately raise one leg higher while lowering the other, then switch — like scissors cutting. Keep your lower back pressed into the floor and core engaged. Move in a controlled manner.",
    "description_ru": "Ляг на спину, руки под поясницей или вдоль тела. Подними обе ноги на несколько сантиметров от пола. Попеременно поднимай одну ногу выше, опуская другую, затем меняй — как ножницы. Поясница прижата к полу, кор напряжён. Двигайся плавно и контролируемо."
  },
  {
    "slug": "v-up",
    "category": "strength",
    "name": "V-Ups",
    "name_ru": "Складка",
    "tags": [
      "core",
      "intermediate",
      "home"
    ],
    "difficulty": 3,
    "base_xp": 12,
    "required_level": 2,
    "equipment": "none",
    "description": "Lie on your back with arms extended overhead and legs straight. Simultaneously lift your legs and torso, reaching your hands toward your toes — your body forms a V shape. Lower back down with control. Keep your legs and arms straight throughout. This is a challenging full core exercise.",
    "description_ru": "Ляг на спину, руки вытянуты за головой, ноги прямые. Одновременно подними ноги и корпус, тянись руками к носкам — тело образует букву V. Опустись обратно с контролем. Держи ноги и руки прямыми. Это сложное упражнение для всего кора, также называется \"книжка\"."
  },
  {
    "slug": "windshield-wiper",
    "category": "strength",
    "name": "Windshield Wipers",
    "name_ru": "Дворники",
    "tags": [
      "core",
      "forearms",
      "advanced",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 4,
    "base_xp": 18,
    "required_level": 6,
    "equipment": "pullup-bar",
    "description": "Lie on your back with arms extended to the sides for stability. Raise your legs straight up toward the ceiling. Keeping legs together and straight, lower them to one side until they nearly touch the floor, then lift and lower to the other side — like a windshield wiper. Your shoulders stay flat on the floor. This intensely works the obliques.",
    "description_ru": "Ляг на спину, руки разведены в стороны для устойчивости. Подними прямые ноги вертикально вверх. Держа ноги вместе и прямыми, опусти их в одну сторону почти до пола, затем подними и опусти в другую сторону — как дворники на машине. Плечи остаются прижатыми к полу. Интенсивно прорабатывает косые мышцы живота."
  },
  {
    "slug": "windshield-wiper-floor",
    "category": "strength",
    "name": "Floor Windshield Wipers",
    "name_ru": "Дворники на полу",
    "tags": [
      "core",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 2,
    "equipment": "none"
  },
  {
    "slug": "toe-touch",
    "category": "strength",
    "name": "Toe Touches",
    "name_ru": "Касания носков",
    "tags": [
      "core",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 6,
    "required_level": 1,
    "equipment": "none"
  },
  {
    "slug": "dead-bug",
    "category": "strength",
    "name": "Dead Bug",
    "name_ru": "Мёртвый жук",
    "tags": [
      "core",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 6,
    "required_level": 1,
    "equipment": "none",
    "description": "Lie on your back with arms reaching toward the ceiling and knees bent at 90 degrees (shins parallel to floor). Slowly extend your right arm behind your head while straightening your left leg toward the floor. Return to start and repeat on the opposite side. Keep your lower back pressed into the floor throughout — this is key! Great for core stability.",
    "description_ru": "Ляг на спину, руки подняты вертикально вверх, колени согнуты под 90 градусов (голени параллельны полу). Медленно опусти правую руку за голову, одновременно выпрямляя левую ногу к полу (но не касаясь его). Вернись в исходное положение и повтори на другую сторону. Поясница всё время прижата к полу — это ключевой момент! Отличное упражнение для стабильности кора."
  },
  {
    "slug": "bird-dog",
    "category": "strength",
    "name": "Bird Dog",
    "name_ru": "Птица-собака",
    "tags": [
      "core",
      "lower-back",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 6,
    "required_level": 1,
    "equipment": "none"
  },
  {
    "slug": "flutter-kick",
    "category": "strength",
    "name": "Flutter Kicks",
    "name_ru": "Флаттер кики",
    "tags": [
      "core",
      "hip-flexors",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 8,
    "required_level": 1,
    "equipment": "none",
    "description": "Lie on your back with hands under your lower back. Lift both legs a few inches off the floor. Make small, rapid up-and-down kicking motions with straight legs, alternating which leg goes up and down. Keep your core tight and lower back pressed down. The smaller and faster the kicks, the more challenging.",
    "description_ru": "Ляг на спину, руки под поясницей. Подними обе ноги на несколько сантиметров от пола. Делай небольшие быстрые махи прямыми ногами вверх-вниз, чередуя ноги. Держи кор напряжённым, поясницу прижатой к полу. Чем меньше и быстрее махи, тем сложнее упражнение."
  },
  {
    "slug": "heel-touches",
    "category": "strength",
    "name": "Heel Touches",
    "name_ru": "Касания пяток",
    "tags": [
      "core",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 6,
    "required_level": 1,
    "equipment": "none"
  },
  {
    "slug": "ab-wheel-rollout",
    "category": "strength",
    "name": "Ab Rollout",
    "name_ru": "Раскатка на пресс",
    "tags": [
      "core",
      "shoulders",
      "advanced",
      "home"
    ],
    "difficulty": 4,
    "base_xp": 15,
    "required_level": 5,
    "equipment": "none",
    "description": "Kneel on the floor and grip an ab wheel (or barbell with round plates) with both hands. Slowly roll the wheel forward, extending your body as far as you can while keeping your core engaged and back flat — don't let your lower back sag. Roll back to the starting position using your abs. Start with partial range of motion and increase as you get stronger.",
    "description_ru": "Встань на колени и возьмись обеими руками за ролик для пресса (или штангу с круглыми блинами). Медленно кати ролик вперёд, вытягивая тело как можно дальше, сохраняя кор напряжённым и спину прямой — не давай пояснице провисать. Откати обратно в исходное положение, работая прессом. Начни с частичной амплитуды и увеличивай по мере укрепления мышц."
  },
  {
    "slug": "dragon-flag",
    "category": "strength",
    "name": "Dragon Flag",
    "name_ru": "Флаг дракона",
    "tags": [
      "core",
      "elite",
      "home",
      "bench"
    ],
    "difficulty": 5,
    "base_xp": 25,
    "required_level": 10,
    "equipment": "bench",
    "description": "Lie on a bench and grip it behind your head. Lift your legs and torso until only your upper back/shoulders rest on the bench — your body is nearly vertical. Slowly lower your body as a straight unit, keeping everything from shoulders to toes in a line. Don't let your hips bend. Lower until nearly parallel to the floor, then raise back up. This is an elite-level core exercise.",
    "description_ru": "Ляг на скамью и возьмись руками за её край за головой. Подними ноги и корпус, пока только верхняя часть спины/плечи не останутся на скамье — тело почти вертикально. Медленно опускай тело как единое целое, сохраняя прямую линию от плеч до носков. Не сгибайся в бёдрах. Опустись почти до параллели с полом, затем подними обратно. Это упражнение элитного уровня для кора."
  },
  {
    "slug": "toes-to-bar",
    "category": "strength",
    "name": "Toes to Bar",
    "name_ru": "Носки к перекладине",
    "tags": [
      "core",
      "forearms",
      "advanced",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 4,
    "base_xp": 15,
    "required_level": 5,
    "equipment": "pullup-bar",
    "description": "Hang from a pull-up bar with arms extended. In one controlled movement, raise your straight legs all the way up until your toes touch the bar. Lower with control. This requires significant core strength, hip flexor flexibility, and grip endurance. Start with hanging leg raises if you can't reach the bar yet.",
    "description_ru": "Повисни на турнике, руки выпрямлены. Одним контролируемым движением подними прямые ноги до касания носками перекладины. Опусти с контролем. Это требует значительной силы кора, гибкости сгибателей бедра и выносливости хвата. Начни с подъёма ног в висе, если пока не достаёшь до перекладины."
  },
  {
    "slug": "knee-to-elbow",
    "category": "strength",
    "name": "Knee to Elbow",
    "name_ru": "Колено к локтю в висе",
    "tags": [
      "core",
      "forearms",
      "intermediate",
      "outdoor",
      "pullup-bar"
    ],
    "difficulty": 3,
    "base_xp": 12,
    "required_level": 3,
    "equipment": "pullup-bar"
  },
  {
    "slug": "pike-hold",
    "category": "strength",
    "name": "Pike Hold",
    "name_ru": "Удержание пики",
    "tags": [
      "shoulders",
      "triceps",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 6,
    "required_level": 1,
    "equipment": "none",
    "is_timed": true,
    "description": "Get into a pike position with hands on the floor and hips raised high, body forming an inverted V. Your legs can be straight or slightly bent. Hold this position, focusing on pressing through your shoulders and engaging your core. This builds shoulder stability and is preparatory for pike push-ups and handstands.",
    "description_ru": "Прими позу уголка: руки на полу, таз высоко поднят, тело образует перевёрнутую V. Ноги могут быть прямыми или слегка согнутыми. Удерживай позицию, концентрируясь на давлении через плечи и напряжении кора. Развивает стабильность плеч и готовит к отжиманиям уголком и стойке на руках."
  },
  {
    "slug": "shoulder-tap",
    "category": "strength",
    "name": "Shoulder Taps",
    "name_ru": "Касания плеч в планке",
    "tags": [
      "shoulders",
      "core",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 2,
    "equipment": "none",
    "description": "Start in a high plank (push-up) position. Lift your right hand and tap your left shoulder, then place it back down. Lift your left hand and tap your right shoulder. Continue alternating. The key is to keep your hips completely stable — don't rotate side to side. Widen your feet for more stability if needed.",
    "description_ru": "Начни в упоре лёжа (высокой планке). Подними правую руку и коснись левого плеча, затем верни на место. Подними левую руку и коснись правого плеча. Продолжай чередовать. Ключевой момент — держать бёдра абсолютно стабильными, не вращаться из стороны в сторону. Расставь ноги шире для большей устойчивости."
  },
  {
    "slug": "wall-walk",
    "category": "strength",
    "name": "Wall Walks",
    "name_ru": "Заходы на стену",
    "tags": [
      "shoulders",
      "triceps",
      "core",
      "advanced",
      "home",
      "wall"
    ],
    "difficulty": 4,
    "base_xp": 15,
    "required_level": 5,
    "equipment": "wall",
    "description": "Start in a push-up position with your feet against a wall. Walk your feet up the wall while simultaneously walking your hands closer to the wall. Continue until you're in a handstand position facing the wall (chest to wall). Then walk back down to the starting position. This builds shoulder strength and handstand confidence.",
    "description_ru": "Начни в упоре лёжа, стопы касаются стены. Иди ногами вверх по стене, одновременно переставляя руки ближе к стене. Продолжай, пока не окажешься в стойке на руках лицом к стене (грудью к стене). Затем вернись обратно в исходное положение. Развивает силу плеч и уверенность в стойке на руках."
  },
  {
    "slug": "wall-shoulder-touch",
    "category": "strength",
    "name": "Wall Shoulder Touch",
    "name_ru": "Касания плеч у стены",
    "tags": [
      "shoulders",
      "core",
      "advanced",
      "home",
      "wall"
    ],
    "difficulty": 4,
    "base_xp": 15,
    "required_level": 5,
    "equipment": "wall"
  },
  {
    "slug": "crab-walk",
    "category": "strength",
    "name": "Crab Walk",
    "name_ru": "Крабья ходьба",
    "tags": [
      "shoulders",
      "triceps",
      "core",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 2,
    "equipment": "none",
    "description": "Sit on the floor, place your hands behind you with fingers pointing forward, and lift your hips off the ground. Walk forward, backward, or sideways using your hands and feet while keeping hips raised. Keep your core engaged and don't let your hips sag. This works shoulders, triceps, and core in a unique way.",
    "description_ru": "Сядь на пол, поставь руки позади себя пальцами вперёд и подними таз от пола. Ходи вперёд, назад или в стороны, используя руки и ноги, сохраняя таз поднятым. Держи кор напряжённым, не давай тазу провисать. Необычным образом тренирует плечи, трицепсы и кор."
  },
  {
    "slug": "bear-crawl",
    "category": "strength",
    "name": "Bear Crawl",
    "name_ru": "Медвежья ходьба",
    "tags": [
      "shoulders",
      "core",
      "quads",
      "intermediate",
      "home"
    ],
    "difficulty": 2,
    "base_xp": 10,
    "required_level": 2,
    "equipment": "none",
    "description": "Start on all fours with knees hovering just above the ground. Move forward by stepping with your right hand and left foot together, then left hand and right foot together (opposite limbs move together). Keep your back flat, hips low, and knees close to the ground. Move slowly and controlled — this is harder than it looks!",
    "description_ru": "Встань на четвереньки, колени зависают прямо над полом (не касаются его). Двигайся вперёд, переставляя правую руку и левую ногу вместе, затем левую руку и правую ногу (противоположные конечности двигаются одновременно). Спина прямая, таз низко, колени близко к полу. Двигайся медленно и контролируемо — это сложнее, чем кажется!"
  },
  {
    "slug": "prone-arm-circle",
    "category": "strength",
    "name": "Prone Arm Circles",
    "name_ru": "Круги руками лёжа",
    "tags": [
      "shoulders",
      "back",
      "beginner",
      "home"
    ],
    "difficulty": 1,
    "base_xp": 5,
    "required_level": 1,
    "equipment": "none"
  }
]